

import streamlit as st

# 問題と解答のデータ
data = {
    "問1": {
        "question": "Aに当てはまる言葉を下記の語群から選び、文章を完成させましょう。巷には過激な方法で急激に体重を減らすダイエット法がたくさん宣伝されています。単品ダイエットや偏食ダイエットなど極端に摂取量を抑えるダイエットを続けると、体脂肪だけではなく（　A　）量や骨量も減り、皮膚がやつれたり体調を崩してしまうというような健康障害の危険性があります。どんなに健康食品でも、「それしかとらない」という方法は絶対に避けましょう。",
        "options": ["①筋肉", "②水分", "③皮下脂肪"],
        "answers": ["①筋肉"]
    },
    "問2":{
        "question": "A～Cの言葉を下記の語群から選び、文章を完成させましょう。BMI値30以下の人で月に（　A　）ｋｇ前後、またはそれ以上のハイペースで短期間に減量すると、（　B　）や拒食を反復するなどの心身のトラブルを引き起こしやすくなります。からだの中で何が変化しているのか、自分を見極めること、意外に気づけない（　C　）バランスにも配慮し前向きに楽しく食事ができているのか気を付けることも美しく健康的に痩せるためのキーポイントになります。",
        "options": ["①2～3", "②4～5", "③過食", "④間食", "⑤メンタル", "⑥カロリー"],
        "answers": ["②4～5", "③過食", "⑤メンタル"]
    },
    "問3": {
        "question": "A～Cの言葉を下記の語群から選び、文章を完成させましょう。今後、あなたがプロとして減量指導をしていくときは決して画一的なスタイルになってはいけません。人によって体重は減らなくても（　A　）が減り筋肉量を増えることを目的にする場合もあり、個人の（　B　）分析に適した減量目標が設定されるべきなのです。治療の最終目標は（　C　）を防ぐことです。",
        "options": ["①コレステロール", "②体脂肪", "③生活習慣", "④身体組成", "⑤リバウンド", "⑥ウェイトサイクリング"],
        "answers": ["②体脂肪", "④身体組成", "⑥ウェイトサイクリング"]
    },
    "問４": {
        "question": "A～Cの言葉を下記の語群から選び、文章を完成させましょう。減量目標の設定は「（　A　）分析=自分自身の正確なデータ」を基に、初期の減量目標を（　B　）なレベルへと設定し、（　C　）的な目標は個人の至適体重を目指すことを考慮します。",
        "options": ["①行動", "②身体組成", "③理想的", "④現実的", "⑤長期的", "⑥短期的"],
        "answers": ["②身体組成", "④現実的", "⑤長期的"]
    } ,
    "問5": {
        "question": "A～Cの言葉を下記の語群から選び、文章を完成させましょう。正常の場合、体脂肪が溜まりすぎると白色脂肪細胞から（　A　）という痩せるホルモンが分泌され、満腹中枢や交感神経を刺激し、食欲を抑えたり（　B　）エネルギーを増やすという事がおこなわれます。人間の場合、ob遺伝子以外にも40種以上の（　C 　）関連遺伝子が関与していると考えられます。",
        "options": ["①レプチン", "②グリセロール", "③運動", "④消費", "⑤食欲", "⑥肥満"],
        "answers": ["①レプチン", "④消費", "⑥肥満"]
    } ,
    "問6": {
        "question": "A～Cの言葉を下記の語群から選び、文章を完成させましょう。太りやすい生活環境の中で、（　A　）の予防や解消を目指すには、無意識に繰り返している日頃の（　B　）を冷静に見直し、太りにくい（　C　）スタイルを確立していくことが必要です。",
        "options": ["①病気", "②肥満", "③生活習慣", "④食生活", "⑤ビジネス", "⑥ライフ"],
        "answers": ["②肥満", "③生活習慣", "⑥ライフ"]
    }
}

def main():
    st.title('レギュラーダイエットマスター第4章復習問題')
    score = 0
    for key, value in data.items():
        st.write(f"### {key}")
        st.write(value["question"])
        answers = st.multiselect("選択肢を選んでください:", value["options"])
        if answers == value["answers"]:
            score += 1
            st.write("正解です！")
        #else:
            #st.write("不正解です。")
            #st.write(f"正解は {value['answers']} です。")
    st.write(f"### スコア: {score}/{len(data)}")
    st.write(f"# 正答率は **{round(score * 100/ len(data))}%** です！")

if __name__ == "__main__":
    main()
